Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can use the built-in template functions to do conditional, list, etc. Read more about https://lit.dev/docs/templates/overview/[Lit Templates]
ja_jp: 組み込みのテンプレート関数を使用して、conditional、list などを実行できます。詳細は、 https://lit.dev/docs/templates/overview/[Lit テンプレート] を参照してください。

source: You can use the following authentication mechanisms with the Infinispan client:
ja_jp: Infinispanクライアントでは、以下の認証メカニズムを使用することができます:

source: You can use the following command as usual:
ja_jp: 以下のコマンドは通常通り使用できます。

source: You can use the following configuration properties to alter how it works:
ja_jp: 次の設定プロパティーを使用して、動作を変更できます。

source: You can use the generated key pair instead of those used in this quickstart.
ja_jp: このクイックスタートで使用されているキーペアの代わりに、生成されたキーペアを使用できます。

source: You can use the generated pair of keys instead of the keys used in this quickstart.
ja_jp: このクイックスタートで使用される鍵の代わりに、生成された鍵のペアを使用できます。

source: You can use the link:https://openid.net/specs/openid-connect-frontchannel-1_0.html[Front-channel logout] to log out the current user directly from the user agent, for example, the browser. It is similar to <<back-channel-logout,Back-channel logout>>, but the logout steps are executed by the user agent (such as the browser) rather than in the background by the OIDC provider. This option is rarely used.
ja_jp: link:https://openid.net/specs/openid-connect-frontchannel-1_0.html[フロントチャネルログアウト] を使用すると、ブラウザーなどのユーザーエージェントから現在のユーザーを直接ログアウトできます。 これは <<back-channel-logout,バックチャネルログアウト>> と似ていますが、ログアウト手順はブラウザーなどのユーザーエージェントによって実行され、OIDC プロバイダーがバックグラウンドで実行することはありません。 これは、ほとんど使用されないオプションです。

source: You can use the link:https://www.keycloak.org/docs/latest/authorization_services/#_service_client_api[Keycloak Authorization Client Java API] for advanced tasks, such as managing resources and getting permissions directly from Keycloak. To enable this functionality, inject an `AuthzClient` instance into your beans:
ja_jp: リソースの管理や Keycloak からの直接の権限取得などの高度なタスクについては、link:https://www.keycloak.org/docs/latest/authorization_services/#_service_client_api[Keycloak Authorization Client Java API] を参照してください。 この機能を有効にするには、Bean に `AuthzClient` インスタンスを注入します。

source: You can use the same approach as described in the xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[OpenID Connect Bearer Token Integration testing] `Local public key` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: xref:security-oidc-bearer-token-authentication.adoc#bearer-token-integration-testing[OpenID Connect Bearer Token Integration testing] `Local public key` セクションで説明されているのと同じアプローチを使用できますが、代わりに MP JWT 設定プロパティーを使用するように `application.properties` のみを変更します。

source: You can use the same approach as described in the xref:security-oidc-bearer-token-authentication.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] `Local Public Key` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: xref:security-oidc-bearer-token-authentication.adoc#integration-testing[OpenID Connect Bearer Token結合テスト] `Local Public Key` のセクションで説明したのと同じアプローチを使用できますが、代わりに MP JWT 設定プロパティを使用するように `application.properties` を変更するだけです：

source: You can use the same approach as described in the xref:security-openid-connect#integration-testing.adoc[OpenID Connect Bearer Token Integration testing] `Local Public Key` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: xref:security-openid-connect#integration-testing.adoc[OpenID Connect Bearer トークン統合テスト] の `Local Public Key` セクションで説明したのと同じアプローチを使用できますが、その場合は代わりに MPJWT 設定プロパティーを使用するように `application.properties` を変更します。

source: You can use the same approach as described in the xref:security-openid-connect.adoc#integration-testing[OpenID Connect Bearer Token Integration testing] `Local Public Key` section but only change the `application.properties` to use MP JWT configuration properties instead:
ja_jp: xref:security-openid-connect#integration-testing.adoc[OpenID Connect Bearer トークン統合テスト] の `Local Public Key` セクションで説明したのと同じアプローチを使用できますが、その場合は代わりに MPJWT 設定プロパティーを使用するように `application.properties` を変更します。

source: You can use the same configuration to override a discovered endpoint URL if that URL is not suitable for the local Quarkus endpoint and a more specific value is required.
ja_jp: 検出されたエンドポイント URL がローカルの Quarkus エンドポイントに適しておらず、より具体的な値が必要な場合は、同じ設定を使用して上書きできます。

source: You can use the standard Quarkus `@Transactional` annotation on tests, but this means that the changes your test makes to the database will be persistent. If you want any changes made to be rolled back at the end of the test you can use the `io.quarkus.test.TestTransaction` annotation. This will run the test method in a transaction, but roll it back once the test method is complete to revert any database changes.
ja_jp: テストでは標準のQuarkus `@Transactional` アノテーションを使用することができますが、これは、テストでデータベースに加えた変更が永続化されることを意味します。テストの終了時に変更をロールバックしたい場合は、 `io.quarkus.test.TestTransaction` アノテーションを使用することができます。これは、トランザクション内でテストメソッドを実行しますが、テストメソッドが完了したらロールバックして、データベースの変更を元に戻します。

source: You can use the xref:./qute.adoc[Qute templating engine] in your JBang script by adding the `quarkus-qute` dependency. You also need to include the `templates` directory in the script:
ja_jp: `quarkus-qute` 依存関係を追加することで、JBang スクリプトで xref:./qute.adoc[Qute テンプレートエンジン] を使用できます。 スクリプトに `templates` ディレクトリーも含める必要があります。

source: You can use the xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM] Dev Service.
ja_jp: xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM] Dev Service を使用できます。

source: You can use the xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM] devservice.
ja_jp: xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM] devservice を使用できます。

source: You can use the {openshift-long} CLI to create applications and manage your {openshift} projects. Use the information provided to create an {openshift} project or to switch to an existing one.
ja_jp: {openshift-long} を使用することができます。CLI を使用してアプリケーションを作成し、{openshift} プロジェクトを管理します。 この情報を使って {openshift} プロジェクトを作成したり、既存のプロジェクトに切り替えることができます。

source: You can use them if you want, but we also support what we call **PanacheQL** that can be seen as a subset of link:https://docs.oracle.com/javaee/7/tutorial/persistence-querylanguage.htm#BNBTG[JPQL] (or link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL]) and allows you to easily express a query. MongoDB with Panache will then map it to a MongoDB native query.
ja_jp: link:https://docs.oracle.com/javaee/7/tutorial/persistence-querylanguage.htm#BNBTG[JPQL](または link:https://docs.jboss.org/hibernate/orm/5.4/userguide/html_single/Hibernate_User_Guide.html#hql[HQL])のサブセットとも言える *PanacheQL*というものもサポートしており、簡単にクエリを表現することができます。MongoDB with Panacheは、それをMongoDBのネイティブクエリにマッピングします。

source: You can use them if you want, but we also support what we call **PanacheQL** that can be seen as a subset of link:https://docs.oracle.com/javaee/7/tutorial/persistence-querylanguage.htm#BNBTG[JPQL] (or link:{hibernate-orm-docs-url}#hql[HQL]) and allows you to easily express a query. MongoDB with Panache will then map it to a MongoDB native query.
ja_jp: link:https://docs.oracle.com/javaee/7/tutorial/persistence-querylanguage.htm#BNBTG[JPQL] (または link:{hibernate-orm-docs-url}#hql[HQL]) のサブセットとも言える *PanacheQL* もサポートしており、簡単にクエリーを表現できます。 MongoDB with Panacheは、それをMongoDBのネイティブクエリーにマッピングします。

source: You can use this AOT cache when launching the application like so:
ja_jp: このAOTキャッシュは、アプリケーションの起動時に次のように使用できます：

source: You can use this same configuration to override a discovered endpoint URL if that URL does not work for the local Quarkus endpoint and a more specific value is required. For example, a provider that supports both global and application-specific end-session endpoints returns a global end-session URL such as `http://localhost:8180/oidcprovider/account/global-logout`. This URL will log the user out of all the applications into which the user is currently logged in. However, if the requirement is for the current application to log the user out of a specific application only, you can override the global end-session URL, by setting the `quarkus.oidc.end-session-path=logout` parameter.
ja_jp: 検出されたエンドポイントURLがローカルのQuarkusエンドポイントで機能せず、より具体的な値が必要な場合は、この同じ設定を使用して、エンドポイントURLをオーバーライドできます。 たとえば、グローバルエンドセッションエンドポイントとアプリケーション固有のエンドセッションエンドポイントの両方をサポートするプロバイダは、次のようなグローバルエンドセッションURLを返します。 `http://localhost:8180/oidcprovider/account/global-logout` . このURLは、ユーザーが現在ログインしているすべてのアプリケーションからユーザーをログアウトします。 ただし、現在のアプリケーションで特定のアプリケーションのみからユーザーをログアウトさせる必要がある場合は、 `quarkus.oidc.end-session-path=logout` パラメータを設定することで、グローバル・エンド・セッション URL をオーバーライドできます。

source: You can use xref:funqy-http.adoc[Funqy HTTP] on Azure Functions. This allows you to invoke on multiple Funqy functions using HTTP deployed as one Azure Function.
ja_jp: Azure Functionsで link:funqy-http.html[Funqy HTTP]を使うことができます。これにより、1つのAzure FunctionとしてデプロイされたHTTPを使って、複数のFunqy関数を呼び出すことができます。

source: You can use xref:security-properties.adoc[quarkus-elytron-security-properties-file] for testing security. This supports both embedding user info in `application.properties` and standalone properties files.
ja_jp: セキュリティのテストには xref:security-properties.adoc[quarkus-elytron-security-properties-file] が使えます。これは、 `application.properties` にユーザー情報を埋め込むことと、スタンドアロンのプロパティファイルの両方をサポートしています。

source: You can use your preferred `java.security.Permission` implementation. By default, string-based permission is performed by `io.quarkus.security.StringPermission`.
ja_jp: 希望する `java.security.Permission` 実装を使用できます。 デフォルトでは、文字列ベースの権限は `io.quarkus.security.StringPermission` によって実行されます。

source: You can verify ID and access JSON Web Token (JWT) tokens by using the refreshable JSON Web Key (JWK) set or introspect them remotely. However, opaque, also known as binary tokens, can only be introspected remotely.
ja_jp: リフレッシュ可能な JSON Web Key (JWK) セットを使用して ID を検証し、JSON Web Token (JWT) トークンにアクセスしたり、リモートでそれらをイントロスペクトしたりできます。 ただし、バイナリートークンとも呼ばれる不透明トークンは、リモートでのみイントロスペクトできます。

source: You can verify ID and access JWT tokens by using the refreshable JSON Web Key (JWK) set or you can introspect them remotely. However, opaque (binary) tokens can only be introspected remotely.
ja_jp: リフレッシュ可能な JSON Web Key (JWK) セットを使用して ID とアクセス JWT トークンを検証することも、リモートでイントロスペクトすることもできます。 ただし、不透明な（バイナリの）トークンはリモートでのみイントロスペクトできます。

source: You can verify that the container service is really running and responding at the URI specified by `DOCKER_HOST` with `podman-remote`.
ja_jp: `DOCKER_HOST` で指定した URI でコンテナサービスが実際に動作し、応答していることを `podman-remote` で確認することができます。

source: You can view the acquired access and ID tokens, for example:
ja_jp: 取得したアクセストークンやIDトークンなどを確認することができます。

source: You can visualize your API's operations and schemas. image:openapi-swaggerui-guide-screenshot01.png[alt=Visualize your API]
ja_jp: APIの操作やスキーマを可視化することができます。 image:openapi-swaggerui-guide-screenshot01.png[alt="Visualize your API"]

source: You can write `delete` finder methods. Just like finder methods, except their action is to delete entities, optionally returning how many were deleted.
ja_jp: `delete` ファインダーメソッドを記述できます。これはファインダーメソッドと似ていますが、そのアクションはエンティティを削除することであり、オプションで削除された数を返します。

source: You can write your component test like:
ja_jp: コンポーネントテストは次のように記述できます。

source: You can write your mocking test like this:
ja_jp: モック化テストはこのように書くことができます:

source: You can write your test like this:
ja_jp: テストは次のように記述できます。

source: You can! All of the source code and scripts are available at https://github.com/quarkusio/spring-quarkus-perf-comparison. Easy reproducibility for everyone was an important guiding principle when we designed the benchmark, but it does get kind of complicated. In the performance world, "rigorous" and "easy" do not go in the same sentence. As someone who always wants to make hard things accessible, this _really_ frustrates me. In the end, we've ended up with a compromise. If you happen to have a performance lab handy, this is of course ideal. All of the scripts are available for you to run the jobs on your own hardware. If you don't have that kind of setup, but do have a Linux machine, you can still use the expert-approved scripts we use. Under the covers, they use tools like link:https://github.com/Hyperfoil/qDup[qDup] for orchestration and link:https://hyperfoil.io/[Hyperfoil] to drive load without risking coordinated omission, and ensure process isolation.
ja_jp: 可能です！すべてのソースコードとスクリプトは https://github.com/quarkusio/spring-quarkus-perf-comparison で利用できます。誰もが簡単に再現できることは、ベンチマークを設計する上で重要な基本原則でしたが、少々複雑になります。パフォーマンスの世界では、「厳密」と「簡単」は同じ文脈では使用されません。難しいことを常にアクセスしやすくしたい私としては、これは _本当に_ 歯がゆいです。結局、私たちは妥協点に落ち着きました。もし手元にパフォーマンスラボがあるなら、もちろん理想的です。すべてのスクリプトが自分のハードウェアでジョブを実行できるように利用可能です。そのようなセットアップがなくても、Linuxマシンがある場合は、私たちが使用する専門家が承認したスクリプトを使用できます。内部的には、それらはオーケストレーションに link:https://github.com/Hyperfoil/qDup[qDup] のようなツールを使用し、協調的な省略のリスクなしに負荷を駆動し、プロセスの分離を確実にするために link:https://hyperfoil.io/[Hyperfoil] を使用しています。

source: You can, however, exclude the `protoc` dependency altogether and use the `quarkus.grpc.protoc-path` system property to configure the path to the `protoc` executable installed on your machine. Thus, you don't need to download any `protoc` variants:
ja_jp: ただし、 `protoc` 依存関係を完全に除外し、 `quarkus.grpc.protoc-path` システムプロパティーを使用して、マシンにインストールされている `protoc` 実行可能ファイルへのパスを設定することができます。 したがって、 `protoc` バリアントをダウンロードする必要はありません。

source: You cannot combine the Quarkus `quarkus-oidc` Bearer token and `smallrye-jwt` authentication mechanisms because both mechanisms attempt to verify the token extracted from the HTTP Bearer token authentication scheme.
ja_jp: Quarkus `quarkus-oidc` ベアラートークンと `smallrye-jwt` 認証メカニズムは、両方とも HTTP ベアラートークン認証スキームから抽出されたトークンを検証しようとするため、この 2 つを組み合わせることはできません。

source: You cannot combine the `quarkus-oidc` `Bearer` and `smallrye-jwt` authentication mechanisms because both mechanisms attempt to verify the token extracted from the HTTP `Authorization Bearer` scheme.
ja_jp: `quarkus-oidc` `Bearer` と `smallrye-jwt` の認証メカニズムは、どちらも HTTP `Authorization Bearer` スキームから抽出されたトークンを検証しようとするため、組み合わせることはできません。

source: You cannot extend the user session indefinitely. The returning user with the expired ID token will have to re-authenticate at the OIDC provider endpoint once the refresh token expires.
ja_jp: ユーザーセッションを無期限に延長することはできません。 有効期限が切れた ID トークンを持つ復帰ユーザーは、リフレッシュトークンの有効期限が切れると、OIDC プロバイダーエンドポイントで再認証する必要があります。

source: You cannot extend the user session indefinitely. The returning user with the expired ID token will have to re-authenticate at the OIDC provider endpoint once the refresh token has expired.
ja_jp: このユーザーセッションを無期限に延長することはできません。 有効期限が切れた ID トークンを持つ復帰ユーザーは、リフレッシュトークンの有効期限が切れると、OIDC プロバイダーエンドポイントで再認証する必要があります。

source: You cannot mix ranges and pages: if you use a range, all methods that depend on having a current page will throw an `UnsupportedOperationException`; you can switch back to paging using `page(Page)` or `page(int, int)`.
ja_jp: 範囲とページを混在させることはできません。範囲を使用した場合、現在のページを持っていることに依存するすべてのメソッドは `UnsupportedOperationException` をスローします。 `page(Page)` もしくは `page(int, int)` を使用してページングに切り換えられます。

source: You cannot use `@Transactional` with Hibernate Reactive for your transactions: you must use `@ReactiveTransactional`, and your annotated method must return a `Uni` to be non-blocking. Otherwise it needs be called from a non-`VertxThread` thread and will become blocking.
ja_jp: トランザクションにHibernate Reactiveで `@Transactional` を使用することはできません。 `@ReactiveTransactional` を使用する必要があり、アノテーションされたメソッドは `Uni` を返してノンブロッキングにする必要があります。そうでない場合は、 `VertxThread` 以外のスレッドから呼び出される必要があり、ブロッキングになります。

source: You cannot use `@Transactional` with Hibernate Reactive for your transactions: you must use `@ReactiveTransactional`, and your annotated method must return a `Uni` to be non-blocking. Otherwise, it needs be called from a non-`VertxThread` thread and will become blocking.
ja_jp: トランザクションにHibernate Reactiveで `@Transactional` を使用することはできません。 `@ReactiveTransactional` を使用する必要があり、アノテーションされたメソッドはノンブロッキングにするために `Uni` を返さなければなりません。そうしないと、 `VertxThread` 以外のスレッドから呼び出される必要が出てきて、ブロッキングになります。

source: You cannot use `UserTransaction` in a method having a transaction started by a `@Transactional` call.
ja_jp: `@Transactional` によって呼び出されたトランザクションと持つメソッドでは、 `UserTransaction` を使用できません。

source: You cannot use both servers at the same time.
ja_jp: 両方のサーバーを同時に使用することはできません。

source: You cannot use open blocks (`--`) in your Asciidoctor documentation. All the other types of blocks (source, admonitions...) are supported.
ja_jp: Asciidoctor のドキュメントでは、オープンブロック ( `--` ) を使用することはできません。他のすべてのタイプのブロック (ソース、アドミッション...) がサポートされています。

source: You cannot use the `@Transactional` annotation with Hibernate Reactive for your transactions: you must use `@WithTransaction`, and your annotated method must return a `Uni` to be non-blocking.
ja_jp: Hibernate Reactive で `@Transactional` アノテーションをトランザクションに使用することはできません。 `@WithTransaction` を使用する必要があります。また、アノテーションが付けられたメソッドが非ブロッキングとなるように `Uni` を返す必要があります。

source: You cannot use the pub/sub feature from within a transaction.
ja_jp: トランザクションの中から pub/sub 機能を使用することはできません。

source: You cannot use type references when using transaction. This is a known limitation.
ja_jp: トランザクションを使用する場合、型参照は使用できません。これは既知の制限です。

source: You could already use GraalVM 22.0 with Quarkus 2.7 but it is now the default version in 2.8.
ja_jp: GraalVM 22.0はQuarkus 2.7で既に使用できましたが、2.8ではデフォルトのバージョンになりました。

source: You create an Hibernate entity instance from this payload,
ja_jp: このペイロードから Hibernate エンティティーインスタンスを作成します。

source: You do not have to bring provider-specific libraries in order to achieve this, but instead you can use a reactive `Token Propagation` filter, which can be bound to a given REST client with a simple annotation. For more information, see the Quarkus xref:security-openid-connect-client-reference.adoc#token-propagation-rest[Access token propagation] guide.
ja_jp: これを実現するためにプロバイダー固有のライブラリーを用意する必要はありませんが、代わりに、簡単なアノテーションを使用して特定の REST クライアントにバインドできるリアクティブ `Token Propagation` フィルターを使用できます。 詳細は、Quarkus xref:security-openid-connect-client-reference.adoc#token-propagation-rest[アクセストークンの伝播] ガイドを参照してください。

source: You do not have to configure anything at all to get started with bearer access tokens xref:security-openid-connect-dev-services.adoc[in the dev mode].
ja_jp: xref:security-openid-connect-dev-services.adoc[開発モード] でベアラーアクセストークンを使い始めるために、何も設定する必要はありません。

source: You do not have to set `quarkus.oidc.authentication.redirect-path` immediately because Quarkus assumes the current request URL is an authorization code flow redirect URL if no `quarkus.oidc.authentication.redirect-path` is configured. For example, to test that a <<google>> authentication is working, you can have a Quarkus endpoint listening on `/google` and update the Google dashboard that `http://localhost:8080/google` redirect URI is supported. Setting `quarkus.oidc.authentication.redirect-path` property will be required once your secured application URL space grows.
ja_jp: `quarkus.oidc.authentication.redirect-path` をすぐに設定する必要はありません。その理由として `quarkus.oidc.authentication.redirect-path` が設定されていない場合、Quarkus は現在のリクエスト URL が認可コードフローのリダイレクト URL であると想定するためです。たとえば、<<google>> 認証が機能している場合は、Quarkus エンドポイントを `/google` でリッスンし、Google ダッシュボードを更新して `http://localhost:8080/google` リダイレクト URI がサポートされていることを確認できます。保護されたアプリケーションの URL スペースが増大すると、 `quarkus.oidc.authentication.redirect-path` プロパティーの設定が必要になります。

source: You do not have to set a signing key identifier (`kid` header) if a single JSON Web Key (JWK) containing a `kid` property is used.
ja_jp: `kid` プロパティーを含む単一の JSON Web Key (JWK) が使用される場合、署名鍵の識別子 (`kid` ヘッダー) を設定する必要はありません。

source: You do not need to add this property in the `application.properties` file. Instead, you can pass it as a command-line argument:
ja_jp: このプロパティを `application.properties` ファイルに追加する必要はありません。代わりに、コマンドライン引数として渡すことができます：

source: You do not need to declare a different driver to enable tracing. If you use a JDBC driver, you need to follow xref:opentelemetry-tracing.adoc#jdbc[the instructions in the OpenTelemetry extension].
ja_jp: トレーシングを有効化するために別のドライバーを宣言する必要はありません。 JDBC ドライバーを使用する場合は、xref:opentelemetry-tracing.adoc#jdbc[OpenTelemetry エクステンションの手順] に従う必要があります。

source: You do not need to disable policy checks for a Keycloak Authorization Policy when using configurations like the following:
ja_jp: 次のような設定を使用する場合、Keycloak Authorization Policy のポリシーチェックを無効にする必要はありません。

source: You don't get any memory footprint benefit yet: in most cases, it's comparable to a regular JVM.
ja_jp: 現時点ではメモリフットプリントの恩恵は得られません。ほとんどの場合、通常の JVM と同程度です。

source: You don't have to inject the `vertx` instance; instead, leverage the protected field from `AbstractVerticle`.
ja_jp: `vertx` のインスタンスを注入する必要はなく、代わりに `AbstractVerticle` の protected フィールドを利用します。

source: You don't have to reply to received messages. Typically, for a _fire and forget_ interaction, the messages are consumed and the sender does not need to know about it. To implement this, your consumer method just returns `void`
ja_jp: 受信したメッセージに返信する必要はありません。通常、 _fire and forget(撃ち放し)_ のやりとりでは、送信者はメッセージが消費されたことを知る必要はありません。これを実装するためには、コンシューマーメソッドは `void` を返します。

source: You don't have to reply to received messages. Typically, for a _fire and forget_ interaction, the messages are consumed, and the sender does not need to know about it. To implement this pattern, your consumer method returns `void`.
ja_jp: 受信したメッセージに返信する必要はありません。通常、 _fire and forget_ のインタラクションでは、メッセージは消費され、送信者はそのことを知る必要はありません。このパターンを実装するために、コンシューマー・メソッドは `void` を返します。

source: You don't have to wire anything.
ja_jp: 何も設定しなくても大丈夫です。

source: You don't lose in flexibility; you can override the decision.
ja_jp: 柔軟性が失われるわけではなく、決定を覆すことができます。

source: You don't necessarily need to add this property in the `application.properties`. You can pass it as a command line argument:
ja_jp: このプロパティーを `application.properties` で追加する必要はありません。コマンドラインの引数として渡すことができます。

source: You don't need to declare a different driver because you need tracing. If you use a JDBC driver, you need to follow the instructions in the OpenTelemetry extension xref:opentelemetry.adoc#jdbc[here].
ja_jp: トレースが必要だからといって、別のドライバを宣言する必要はありません。JDBC ドライバーを使用する場合は、 xref:opentelemetry.adoc#jdbc[こちら] のOpenTelemetry エクステンションの説明書に従う必要があります。

source: You don't need to declare methods that are not annotated simply because they exist on the intercepted class. If you want to add method-level bindings to a subset of methods, you only have to declare the methods that are supposed to have an interceptor binding. If you only want to add class-level bindings, you don't have to declare any methods at all.
ja_jp: インターセプトされたクラスに存在するという理由だけで、アノテーションが付けられていないメソッドを宣言する必要はありません。 メソッドのサブセットにメソッドレベルのバインディングを追加する場合は、インターセプターバインディングを指定する予定のメソッドを宣言するだけで済みます。 クラスレベルのバインディングのみを追加する場合は、メソッドを宣言する必要はありません。

source: You don't need to learn the reactive way; you can keep using imperative code.
ja_jp: リアクティブな方法を学ぶ必要はなく、命令型のコードを使い続けることができます。

source: You don't need to set this up, Quarkus automatically injects the reference to the Narayana Transaction Manager. The dependency is included automatically as a transitive dependency of the Hibernate ORM extension. All configuration is optional; for more details see xref:transaction.adoc[Using Transactions in Quarkus].
ja_jp: これを設定する必要はありません。Quarkus は自動的に Narayana Transaction Manager への参照を注入します。この依存関係は、Hibernate ORM エクステンションの推移的依存関係として自動的に含まれます。すべての設定はオプションです。詳細は、xref:transaction.adoc[Quarkusでのトランザクションの使用] を参照してください。

source: You don't need to think about your threads; Quarkus does that for you.
ja_jp: スレッドについて考える必要はありません。Quarkusがあなたのためにそれを行います。
